tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "colordiff"
brew "docker"
brew "fish"
brew "jq"
brew "lesspipe"
brew "mysql-client"
brew "mysql@5.7"
brew "nkf"
brew "nmap"
brew "nodebrew"
brew "php@7.2"
brew "qemu"
brew "reattach-to-user-namespace"
brew "rmtrash"
brew "source-highlight"
brew "sysbench"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
cask "docker"
