tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# brew
brew "colordiff"
brew "jq"
brew "lesspipe"
brew "nkf"
brew "trash"
brew "source-highlight"
brew "telnet"
brew "the_silver_searcher"
brew "tree"
brew "mas"
brew "git-lfs"
brew "pyenv"
brew "nvm"
brew "gh"
brew "duckdb"
brew "direnv"

# cask
cask "docker"
cask "1password"
cask "google-chrome"
cask "google-japanese-ime"
cask "contexts"
cask "iterm2"
cask "scroll-reverser"
cask "visual-studio-code"
cask "dropbox"
cask "slack"
cask "raycast"
cask "beekeeper-studio"
cask "warp"

# mas
mas 'LINE', id: 539883307
mas 'Spark', id: 1176895641
