# brew
brew "colordiff"
brew "jq"
brew "lesspipe"
brew "nkf"
brew "trash"
brew "source-highlight"
brew "telnet"
brew "ripgrep"
brew "tree"
brew "mas"
brew "git-lfs"
brew "gh"
brew "duckdb"
brew "awscli"
brew "bat"
brew "mise"

# cask
cask "docker"
cask "1password"
cask "google-chrome"
cask "contexts"
cask "scroll-reverser"
cask "visual-studio-code"
cask "dropbox"
cask "slack"
cask "raycast"
cask "beekeeper-studio"
cask "session-manager-plugin"
cask "orbstack"
cask "warp"

# mas
# mas 'LINE', id: 539883307
# mas 'Spark', id: 1176895641
# mas "Toggl Track", id: 1291898086
# mas "Kindle", id: 405399194
# mas "Pixelmator Pro", id: 1289583905