amazonwebservices.codewhisperer-for-command-line-companion
astro-build.astro-vscode
biomejs.biome
bradlc.vscode-tailwindcss
charliermarsh.ruff
dbaeumer.vscode-eslint
denoland.vscode-deno
docker.docker
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
firsttris.vscode-jest-runner
github.vscode-github-actions
github.vscode-pull-request-github
gitlab.gitlab-workflow
golang.go
graphql.vscode-graphql
graphql.vscode-graphql-execution
graphql.vscode-graphql-syntax
hashicorp.terraform
hidenba.open-junkfile
juanblanco.solidity
lfs.vscode-emacs-friendly
mechatroner.rainbow-csv
mikestead.dotenv
mishkinf.vscode-edits-history
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-playwright.playwright
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
naumovs.color-highlight
oderwat.indent-rainbow
orta.vscode-jest
prisma.prisma
redhat.vscode-commons
redhat.vscode-xml
redhat.vscode-yaml
rust-lang.rust-analyzer
scala-lang.scala
scalameta.metals
shardulm94.trailing-spaces
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
tamasfe.even-better-toml
urbantrout.refactor-css
vitest.explorer
vscode-icons-team.vscode-icons
vue.volar
wayou.vscode-todo-highlight
wmaurer.vscode-jumpy
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
